docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-05 mer. 13:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>Stewart Platforms</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dehaeze Thomas" />
<link rel="stylesheet" type="text/css" href="./css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Stewart Platforms</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgff0bfd7">1. Simulink Project (link)</a></li>
<li><a href="#org38b9089">2. Stewart Platform Architecture Definition (link)</a></li>
<li><a href="#orgf1c7b3b">3. Simscape Model of the Stewart Platform (link)</a></li>
<li><a href="#org369c8bb">4. Kinematic Analysis (link)</a></li>
<li><a href="#org2e3169e">5. Identification of the Stewart Dynamics (link)</a></li>
<li><a href="#org0fdb910">6. Control</a></li>
<li><a href="#org1f468b1">7. Cubic Configuration (link)</a></li>
<li><a href="#orga2bd0e9">8. Bibliography (link)</a></li>
</ul>
</div>
</div>

<p>
The goal of this project is to provide a Matlab/Simscape Toolbox to study Stewart platforms.
</p>

<p>
The project is divided into several section listed below.
</p>

<div id="outline-container-orgff0bfd7" class="outline-2">
<h2 id="orgff0bfd7"><span class="section-number-2">1</span> Simulink Project (<a href="simulink-project.html">link</a>)</h2>
<div class="outline-text-2" id="text-1">
<p>
The project is managed with a <b>Simulink Project</b>.
Such project is briefly presented <a href="simulink-project.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-org38b9089" class="outline-2">
<h2 id="org38b9089"><span class="section-number-2">2</span> Stewart Platform Architecture Definition (<a href="stewart-architecture.html">link</a>)</h2>
<div class="outline-text-2" id="text-2">
<p>
The way the Stewart Platform is defined is explained <a href="stewart-architecture.html">here</a>.
</p>

<p>
All the geometrical parameters are defined including:
</p>
<ul class="org-ul">
<li>Definition of the location of the frames</li>
<li>Location/orientation of the limbs</li>
<li>Size/inertia of the platforms and the limbs</li>
</ul>

<p>
Other parameters are also defined such as:
</p>
<ul class="org-ul">
<li>Stiffness and damping of the struts</li>
<li>Rest position of the Stewart platform</li>
</ul>
</div>
</div>

<div id="outline-container-orgf1c7b3b" class="outline-2">
<h2 id="orgf1c7b3b"><span class="section-number-2">3</span> Simscape Model of the Stewart Platform (<a href="simscape-model.html">link</a>)</h2>
<div class="outline-text-2" id="text-3">
<p>
The Stewart Platform is then modeled using <a href="https://www.mathworks.com/products/simscape.html">Simscape</a>.
</p>

<p>
The way to model is build and works is explained <a href="simscape-model.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-org369c8bb" class="outline-2">
<h2 id="org369c8bb"><span class="section-number-2">4</span> Kinematic Analysis (<a href="kinematic-study.html">link</a>)</h2>
<div class="outline-text-2" id="text-4">
<p>
From the defined geometry of the Stewart platform, we can perform static analysis such as:
</p>
<ul class="org-ul">
<li><b>Jacobian Analysis</b> that links the velocity of each limb to the velocity of the mobile platform</li>
<li><b>Static Forces Analysis</b> that links the forces applied by each limb to the resulting force/torque applied to the mobile platform</li>
</ul>

<p>
From the strut stiffness, we can also perform a <b>Stiffness Analysis</b> that consists of determining the Stiffness matrix and Compliance matrix of the Stewart platform from the geometry.
</p>

<p>
All these analysis are described <a href="kinematic-study.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-org2e3169e" class="outline-2">
<h2 id="org2e3169e"><span class="section-number-2">5</span> Identification of the Stewart Dynamics (<a href="identification.html">link</a>)</h2>
<div class="outline-text-2" id="text-5">
<p>
The Dynamics of the Stewart platform can be identified using the Simscape model.
</p>

<p>
It is possible to:
</p>
<ul class="org-ul">
<li>Determine the dynamics from the actuators to the various sensors included in the Stewart platform</li>
<li>Extract State Space models for further analysis / control synthesis</li>
<li>Extract the Resonant Frequencies, Modal Damping, and associated Mode Shapes</li>
</ul>

<p>
The code that is used for identification is explained <a href="identification.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-org0fdb910" class="outline-2">
<h2 id="org0fdb910"><span class="section-number-2">6</span> Control</h2>
<div class="outline-text-2" id="text-6">
<p>
The use of active control for Stewart platforms is a wide subject.
Many aspect can be studied.
</p>

<p>
The sensors used is of primary important. We can have:
</p>
<ul class="org-ul">
<li>Sensors located in each strut: relative motion, force sensor, inertial sensor</li>
<li>Sensors measuring the relative motion between the fixed base and the mobile platform</li>
<li>Inertial sensors located on the mobile platform</li>
</ul>

<p>
The control objective can also vary:
</p>
<ul class="org-ul">
<li>Reference Tracking</li>
<li>Active Damping</li>
<li>Vibration Isolation</li>
</ul>

<p>
The Control for Stewart platforms is here studied in the following files:
</p>
<ul class="org-ul">
<li><b>Active Damping</b> (<a href="control-active-damping.html">link</a>).
The use of different sensors are compared for active damping:
<ul class="org-ul">
<li>Inertial Sensor in each strut or fixed to the mobile platform</li>
<li>Force Sensor in each strut</li>
<li>Relative Motion Sensor in each strut</li>
</ul></li>
<li><b>Motion Control</b> (<a href="control-tracking.html">link</a>).
Different control architectures (centralized and decentralized) are compared for the position control of the Stewart platform.</li>
<li><b>Vibration Isolation</b> (<a href="control-vibration-isolation.html">link</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org1f468b1" class="outline-2">
<h2 id="org1f468b1"><span class="section-number-2">7</span> Cubic Configuration (<a href="cubic-configuration.html">link</a>)</h2>
<div class="outline-text-2" id="text-7">
<p>
The cubic configuration is a special class of Stewart platform that has interesting properties.
</p>

<p>
These properties are studied in <a href="cubic-configuration.html">this</a> document.
</p>
</div>
</div>

<div id="outline-container-orga2bd0e9" class="outline-2">
<h2 id="orga2bd0e9"><span class="section-number-2">8</span> Bibliography (<a href="bibliography.html">link</a>)</h2>
<div class="outline-text-2" id="text-8">
<p>
Many text books, PhD thesis and articles related to parallel robots and Stewart platforms are gathered in <a href="bibliography.html">this</a> document.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dehaeze Thomas</p>
<p class="date">Created: 2020-08-05 mer. 13:27</p>
</div>
</body>
</html>
